Engimusing/engimusing-firmware/boards.txt
# Copyright (c) 2015 Engimusing LLC.  All right reserved.
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

engimusing_efm32zgusb.name=Engimusing EFM32ZGUSB
engimusing_efm32zgusb.upload.tool=efm_upload
engimusing_efm32zgusb.upload.protocol=xmodem
engimusing_efm32zgusb.upload.maximum_size=27648
engimusing_efm32zgusb.upload.device=EFM32ZGUSB
engimusing_efm32zgusb.bootloader.tool=
engimusing_efm32zgusb.bootloader.file=
engimusing_efm32zgusb.build.mcu=cortex-m0plus
engimusing_efm32zgusb.build.board=EFM32ZGUSB
engimusing_efm32zgusb.build.core=efm32
engimusing_efm32zgusb.build.ldscript=efm32zg.ld
engimusing_efm32zgusb.build.variant=EFMUSB
engimusing_efm32zgusb.build.variant_system_lib=
engimusing_efm32zgusb.compiler.device=-DEFM32ZG222F32 -DEFM32ZG222
engimusing_efm32zgusb.compiler.mcu=-DCORTEX_M0PLUS
engimusing_efm32zgusb.compiler.efm=-DEFM32ZG
engimusing_efm32zgusb.build.family=EFM32ZG


engimusing_efm32zg108.name=Engimusing EFM32ZG108
engimusing_efm32zg108.upload.tool=efm_upload
engimusing_efm32zg108.upload.protocol=xmodem
engimusing_efm32zg108.upload.maximum_size=27648
engimusing_efm32zg108.upload.device=EFM32ZG108
engimusing_efm32zg108.bootloader.tool=
engimusing_efm32zg108.bootloader.file=
engimusing_efm32zg108.build.mcu=cortex-m0plus
engimusing_efm32zg108.build.board=EFM32ZG108
engimusing_efm32zg108.build.core=efm32
engimusing_efm32zg108.build.ldscript=efm32zg.ld
engimusing_efm32zg108.build.variant=EFM32ZG108
engimusing_efm32zg108.build.variant_system_lib=
engimusing_efm32zg108.compiler.device=-DEFM32ZG108F32 -DEFM32ZG108
engimusing_efm32zg108.compiler.mcu=-DCORTEX_M0PLUS
engimusing_efm32zg108.compiler.efm=-DEFM32ZG
engimusing_efm32zg108.build.family=EFM32ZG

engimusing_efm32zg222.name=Engimusing EFM32ZG222
engimusing_efm32zg222.upload.tool=efm_upload
engimusing_efm32zg222.upload.protocol=xmodem
engimusing_efm32zg222.upload.maximum_size=27648
engimusing_efm32zg222.upload.device=EFM32ZG222
engimusing_efm32zg222.bootloader.tool=
engimusing_efm32zg222.bootloader.file=
engimusing_efm32zg222.build.mcu=cortex-m0plus
engimusing_efm32zg222.build.board=EFM32ZG222
engimusing_efm32zg222.build.core=efm32
engimusing_efm32zg222.build.ldscript=efm32zg.ld
engimusing_efm32zg222.build.variant=EFM32ZG222
engimusing_efm32zg222.build.variant_system_lib=
engimusing_efm32zg222.compiler.device=-DEFM32ZG222F32 -DEFM32ZG222
engimusing_efm32zg222.compiler.mcu=-DCORTEX_M0PLUS
engimusing_efm32zg222.compiler.efm=-DEFM32ZG
engimusing_efm32zg222.build.family=EFM32ZG

engimusing_efm32tg110.name=Engimusing EFM32TG110
engimusing_efm32tg110.upload.tool=efm_upload
engimusing_efm32tg110.upload.protocol=xmodem
engimusing_efm32tg110.upload.maximum_size=27648
engimusing_efm32tg110.upload.device=EFM32TG110
engimusing_efm32tg110.bootloader.tool=
engimusing_efm32tg110.bootloader.file=
engimusing_efm32tg110.build.mcu=cortex-m3
engimusing_efm32tg110.build.board=EFM32TG110
engimusing_efm32tg110.build.core=efm32
engimusing_efm32tg110.build.ldscript=efm32tg.ld
engimusing_efm32tg110.build.variant=EFM32TG110
engimusing_efm32tg110.build.variant_system_lib=
engimusing_efm32tg110.compiler.device=-DEFM32TG110F32 -DEFM32TG110
engimusing_efm32tg110.compiler.mcu=-DCORTEX_M3
engimusing_efm32tg110.compiler.efm=-DEFM32TG
engimusing_efm32tg110.build.family=EFM32TG

engimusing_efm32tg222.name=Engimusing EFM32TG222
engimusing_efm32tg222.upload.tool=efm_upload
engimusing_efm32tg222.upload.protocol=xmodem
engimusing_efm32tg222.upload.maximum_size=27648
engimusing_efm32tg222.upload.device=EFM32TG222
engimusing_efm32tg222.bootloader.tool=
engimusing_efm32tg222.bootloader.file=
engimusing_efm32tg222.build.mcu=cortex-m3
engimusing_efm32tg222.build.board=EFM32TG222
engimusing_efm32tg222.build.core=efm32
engimusing_efm32tg222.build.ldscript=efm32tg.ld
engimusing_efm32tg222.build.variant=EFM32TG222
engimusing_efm32tg222.build.variant_system_lib=
engimusing_efm32tg222.compiler.device=-DEFM32TG222F32 -DEFM32TG222
engimusing_efm32tg222.compiler.mcu=-DCORTEX_M3
engimusing_efm32tg222.compiler.efm=-DEFM32TG
engimusing_efm32tg222.build.family=EFM32TG


engimusing_efm32g232.name=Engimusing EFM32G232
engimusing_efm32g232.upload.tool=efm_upload
engimusing_efm32g232.upload.protocol=xmodem
engimusing_efm32g232.upload.maximum_size=60416
engimusing_efm32g232.upload.device=EFM32G232
engimusing_efm32g232.bootloader.tool=
engimusing_efm32g232.bootloader.file=
engimusing_efm32g232.build.mcu=cortex-m3
engimusing_efm32g232.build.board=EFM32G232
engimusing_efm32g232.build.core=efm32
engimusing_efm32g232.build.ldscript=efm32g.ld
engimusing_efm32g232.build.variant=EFM32G232
engimusing_efm32g232.build.variant_system_lib=
engimusing_efm32g232.compiler.device=-DEFM32G232F64 -DEFM32G232
engimusing_efm32g232.compiler.mcu=-DCORTEX_M3
engimusing_efm32g232.compiler.efm=-DEFM32G
engimusing_efm32g232.build.family=EFM32G

engimusing_efm32wg840.name=Engimusing EFM32WG840
engimusing_efm32wg840.upload.tool=efm_upload
engimusing_efm32wg840.upload.protocol=xmodem
engimusing_efm32wg840.upload.maximum_size=257024
engimusing_efm32wg840.upload.device=EFM32WG840
engimusing_efm32wg840.bootloader.tool=
engimusing_efm32wg840.bootloader.file=
engimusing_efm32wg840.build.mcu=cortex-m4
engimusing_efm32wg840.build.board=EFM32WG840
engimusing_efm32wg840.build.core=efm32
engimusing_efm32wg840.build.ldscript=efm32wg.ld
engimusing_efm32wg840.build.variant=EFM32WG840
engimusing_efm32wg840.build.variant_system_lib=
engimusing_efm32wg840.compiler.device=-DEFM32WG840F256 -DEFM32WG840
engimusing_efm32wg840.compiler.mcu=-DCORTEX_M4
engimusing_efm32wg840.compiler.efm=-DEFM32WG
engimusing_efm32wg840.build.family=EFM32WG

engimusing_efm32wg842.name=Engimusing EFM32WG842
engimusing_efm32wg842.upload.tool=efm_upload
engimusing_efm32wg842.upload.protocol=xmodem
engimusing_efm32wg842.upload.maximum_size=257024
engimusing_efm32wg842.upload.device=EFM32WG842USB
engimusing_efm32wg842.bootloader.tool=
engimusing_efm32wg842.bootloader.file=
engimusing_efm32wg842.build.mcu=cortex-m4
engimusing_efm32wg842.build.board=EFM32WG842
engimusing_efm32wg842.build.core=efm32
engimusing_efm32wg842.build.ldscript=efm32wg.ld
engimusing_efm32wg842.build.variant=EFM32WG842
engimusing_efm32wg842.build.variant_system_lib=
engimusing_efm32wg842.compiler.device=-DEFM32WG842F256 -DEFM32WG842
engimusing_efm32wg842.compiler.mcu=-DCORTEX_M4
engimusing_efm32wg842.compiler.efm=-DEFM32WG
engimusing_efm32wg842.build.family=EFM32WG

engimusing_efm32wg842F64.name=Engimusing EFM32WG842F64
engimusing_efm32wg842F64.upload.tool=efm_upload
engimusing_efm32wg842F64.upload.protocol=xmodem
engimusing_efm32wg842F64.upload.maximum_size=60416
engimusing_efm32wg842F64.upload.device=EFM32WG842USB
engimusing_efm32wg842F64.bootloader.tool=
engimusing_efm32wg842F64.bootloader.file=
engimusing_efm32wg842F64.build.mcu=cortex-m4
engimusing_efm32wg842F64.build.board=EFM32WG842
engimusing_efm32wg842F64.build.core=efm32
engimusing_efm32wg842F64.build.ldscript=efm32wg.ld
engimusing_efm32wg842F64.build.variant=EFM32WG842
engimusing_efm32wg842F64.build.variant_system_lib=
engimusing_efm32wg842F64.compiler.device=-DEFM32WG842F64 -DEFM32WG842
engimusing_efm32wg842F64.compiler.mcu=-DCORTEX_M4
engimusing_efm32wg842F64.compiler.efm=-DEFM32WG
engimusing_efm32wg842F64.build.family=EFM32WG

engimusing_efm32wg842D.name=Engimusing EFM32WG842D
engimusing_efm32wg842D.upload.tool=efm_upload
engimusing_efm32wg842D.upload.protocol=xmodem
engimusing_efm32wg842D.upload.maximum_size=60416
engimusing_efm32wg842D.upload.device=EFM32WG842USB
engimusing_efm32wg842D.bootloader.tool=
engimusing_efm32wg842D.bootloader.file=
engimusing_efm32wg842D.build.mcu=cortex-m4
engimusing_efm32wg842D.build.board=EFM32WG842
engimusing_efm32wg842D.build.core=efm32
engimusing_efm32wg842D.build.ldscript=efm32wg.ld
engimusing_efm32wg842D.build.variant=EFM32WG842D
engimusing_efm32wg842D.build.variant_system_lib=
engimusing_efm32wg842D.compiler.device=-DEFM32WG842D -DEFM32WG842
engimusing_efm32wg842D.compiler.mcu=-DCORTEX_M4
engimusing_efm32wg842D.compiler.efm=-DEFM32WG
engimusing_efm32wg842D.build.family=EFM32WG

